// 1) что такое github ?
// answer:
// GitHub — это веб-платформа для хостинга и совместной разработки 
// 2) какие у него команды? Какие команды есть в git?

// git clone: Клонировать репозиторий на свой компьютер.

// git init: Инициализация нового репозитория.


// git clone: Клонирование существующего репозитория.


// git add: Добавление изменений в индекс (подготовка к коммиту).


// git commit: Создание коммита с зафиксированными изменениями.


// git status: Проверка состояния репозитория.


// git log: Просмотр истории коммитов.


// git branch: Работа с ветками.


// git checkout: Переключение между ветками или восстановление файлов из определенного коммита.


// git merge: Слияние изменений из одной ветки в другую.


// git pull: Получение изменений с удаленного репозитория и их объединение с текущей веткой.


// git push: Отправка изменений в удаленный репозиторий.


// git remote: Управление удаленными репозиториями.
