// практика
// проекты
// не распыляйся
// удели внимание computer science
// не спеши с трудоустройством
// не сравнивай себя с другими
// не нужно помнить все
// синдром самозванца зло
// быстрого и легкого результатат не бывает

/////////////////////////////////////////////////////////////////////////////////////////

// Собеседование на Frontend
        // JAVASCRIPT
// 1-вопрос какие типы данных существуют в js?
// answer: 8 
// 1. number = 5
// 2. string = "строка"
// 3. object = {name: "Nisa"}
// 4. boolean = true/false
// 5. symbol = new Symbol("id")
// 6. null
// 7. undefined
// 8. bigint = 12234567890123456789n       

// 2-вопрос в чем разница между операторами "==" и "==="?
// answer:
// Оператор == сравнивает на равенство,
//  а вот === — на идентичность.

// 3 - вопрос какими способами можно объявить переменную ? Назовите отличия
// answer: 3
// const - не изменяемая
// var - изменяемая
// let - 

// 4 - вопрос в чем разница между null и undefined? 
// answer: 
// undefined неожиданным отсутствием значения, 
// а null — умышленным отсутствием значения.

// 5 - вопрос в чем разница между null и undefined? 
// answer: 
// undefined неожиданным отсутствием значения, 
// var - изменяемая
// а null — умышленным отсутствием значения.

       // CSS
// 1-вопрос свойство display - какие значения принимает и как они работают?
// answer:
// none - это самое простое  значение, .. не показывается на экране ничего
// block - 
// inline 
// inline-block 
// flex 
// grid 

// 2-вопрос какие бывают значения у свойства position? расскажите как ведёт себя каждое свойство?
// answer: 
// static
// relative
// absolute
// fixed
// sticky

// 3-вопрос как отцентровать блок по горизонтали и вертикали?
// answer: 
// display:flex;
// justify-content:center;
// aling-items:center;

// 4-вопрос что делает box-sizing: border-box?
// answer: 
// Свойство box-sizing применяется для изменения алгоритма расчёта ширины и высоты элемента

// 5-вопрос что такое inline стили? И какой они имеют приоритет?
// answer: 
// <div style="display: flex; justify-content: center">Инлайн стили</div>

// 6-вопрос разница между margin и padding?
// answer: 
// Падинги (свойство padding ) — это внутренние отступы от границ элемента до его содержимого
// Маржины (свойство margin ) — это внешние отступы от границ элемента до соседних элементов

// 7-вопрос vh vw указании размеров?
// answer: 
// vh - 1% от высоты окна браузера
// vц - 1% от ширины окна браузера






       // REACT
// 1-вопрос что делает setState()?
// answer: 
// setState() добавляет в очередь изменения в состоянии компонента

// 2-вопрос что такое VirtualDom?
// answer: 
// Virtual DOM (Document Object Model) - это концепция, 
// используемая в веб-разработке для улучшения производительности 
// при работе с интерфейсами веб-приложений


// 3-вопросразница между контролируемыми  и неконтролируемыми компонентами?
// answer: 
//

// 4-вопрос жизненный цикл компонента и его методы?
// answer: 4 ж.ц
// 1. initialization
// 2. ummountion
// 3. mountion
// 4. updation

// 5-вопрос какие основные реакт хуки вы знаете и используете?
// answer: 3
// основные
// 1. useEffect
// 2. useState
// дополнительные
// 3. useConponent
// 4. useReducer
// 5. useMemo
// 6. useCallback
// 7. useRef
// и другие

// / 5-вопрос что такое props?
// answer: 
// props - это параметр, который мы передаем в кампонент







